; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	instrument9 - instrument
	satellite4 - satellite
	instrument10 - instrument
	infrared2 - mode
	spectrograph1 - mode
	thermograph3 - mode
	thermograph0 - mode
	Star1 - direction
	Star2 - direction
	GroundStation0 - direction
	Phenomenon3 - direction
	Planet4 - direction
	Phenomenon5 - direction
	Star6 - direction
	Planet7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Planet14 - direction
	Phenomenon15 - direction
	Planet16 - direction
	Star17 - direction
	Star18 - direction
	Star19 - direction
	Planet20 - direction
	Planet21 - direction
	Planet22 - direction
	Star23 - direction
	Planet24 - direction
	Star25 - direction
	Phenomenon26 - direction
	Star27 - direction
)
(:init
	(supports instrument0 thermograph3)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 infrared2)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon5)
	(supports instrument2 thermograph3)
	(supports instrument2 infrared2)
	(calibration_target instrument2 GroundStation0)
	(supports instrument3 infrared2)
	(calibration_target instrument3 Star2)
	(supports instrument4 infrared2)
	(calibration_target instrument4 GroundStation0)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star19)
	(supports instrument5 infrared2)
	(supports instrument5 spectrograph1)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 Star1)
	(supports instrument6 spectrograph1)
	(calibration_target instrument6 Star1)
	(supports instrument7 spectrograph1)
	(calibration_target instrument7 Star1)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star19)
	(supports instrument8 thermograph3)
	(calibration_target instrument8 Star2)
	(supports instrument9 thermograph3)
	(calibration_target instrument9 Star2)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star23)
	(supports instrument10 thermograph0)
	(calibration_target instrument10 GroundStation0)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star10)
)
(:goal (and
	(pointing satellite0 Planet13)
	(pointing satellite2 Planet4)
	(pointing satellite3 Star17)
	(have_image Phenomenon3 thermograph0)
	(have_image Planet4 spectrograph1)
	(have_image Phenomenon5 thermograph0)
	(have_image Star6 infrared2)
	(have_image Planet7 spectrograph1)
	(have_image Phenomenon9 infrared2)
	(have_image Star10 infrared2)
	(have_image Planet11 thermograph3)
	(have_image Phenomenon12 spectrograph1)
	(have_image Planet13 infrared2)
	(have_image Planet14 spectrograph1)
	(have_image Phenomenon15 spectrograph1)
	(have_image Planet16 thermograph3)
	(have_image Star17 spectrograph1)
	(have_image Star18 infrared2)
	(have_image Star19 thermograph0)
	(have_image Planet20 infrared2)
	(have_image Planet21 infrared2)
	(have_image Planet22 thermograph0)
	(have_image Star23 infrared2)
	(have_image Planet24 thermograph3)
	(have_image Star25 thermograph0)
	(have_image Star27 infrared2)
))

)

; plan
1. (switch_on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 0 of 26
2. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 26
3. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 26
4. (turn_to satellite4 groundstation0 star10)
   deleted: (pointing satellite4 star10)
   added: (pointing satellite4 groundstation0)
   goals met: 0 of 26
5. (calibrate satellite4 instrument10 groundstation0)
   added: (calibrated instrument10)
   goals met: 0 of 26
6. (turn_to satellite4 phenomenon3 groundstation0)
   deleted: (pointing satellite4 groundstation0)
   added: (pointing satellite4 phenomenon3)
   goals met: 0 of 26
7. (take_image satellite4 phenomenon3 instrument10 thermograph0)
   added: (have_image phenomenon3 thermograph0)
   goals met: 1 of 26
8. (turn_to satellite4 phenomenon5 phenomenon3)
   deleted: (pointing satellite4 phenomenon3)
   added: (pointing satellite4 phenomenon5)
   goals met: 1 of 26
9. (take_image satellite4 phenomenon5 instrument10 thermograph0)
   added: (have_image phenomenon5 thermograph0)
   goals met: 2 of 26
10. (turn_to satellite4 planet22 phenomenon5)
   deleted: (pointing satellite4 phenomenon5)
   added: (pointing satellite4 planet22)
   goals met: 2 of 26
11. (take_image satellite4 planet22 instrument10 thermograph0)
   added: (have_image planet22 thermograph0)
   goals met: 3 of 26
12. (turn_to satellite4 star19 planet22)
   deleted: (pointing satellite4 planet22)
   added: (pointing satellite4 star19)
   goals met: 3 of 26
13. (take_image satellite4 star19 instrument10 thermograph0)
   added: (have_image star19 thermograph0)
   goals met: 4 of 26
14. (turn_to satellite4 star25 star19)
   deleted: (pointing satellite4 star19)
   added: (pointing satellite4 star25)
   goals met: 4 of 26
15. (take_image satellite4 star25 instrument10 thermograph0)
   added: (have_image star25 thermograph0)
   goals met: 5 of 26
16. (turn_to satellite3 star17 star23)
   deleted: (pointing satellite3 star23)
   added: (pointing satellite3 star17)
   goals met: 6 of 26
17. (turn_to satellite2 phenomenon9 star19)
   deleted: (pointing satellite2 star19)
   added: (pointing satellite2 phenomenon9)
   goals met: 6 of 26
18. (turn_to satellite2 planet4 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 planet4)
   goals met: 7 of 26
19. (turn_to satellite2 star1 planet4)
   deleted: (pointing satellite2 planet4)
   added: (pointing satellite2 star1)
   goals met: 6 of 26
20. (calibrate satellite2 instrument5 star1)
   added: (calibrated instrument5)
   goals met: 6 of 26
21. (turn_to satellite2 phenomenon12 star1)
   deleted: (pointing satellite2 star1)
   added: (pointing satellite2 phenomenon12)
   goals met: 6 of 26
22. (take_image satellite2 phenomenon12 instrument5 spectrograph1)
   added: (have_image phenomenon12 spectrograph1)
   goals met: 7 of 26
23. (turn_to satellite2 phenomenon15 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 phenomenon15)
   goals met: 7 of 26
24. (take_image satellite2 phenomenon15 instrument5 spectrograph1)
   added: (have_image phenomenon15 spectrograph1)
   goals met: 8 of 26
25. (turn_to satellite2 phenomenon9 phenomenon15)
   deleted: (pointing satellite2 phenomenon15)
   added: (pointing satellite2 phenomenon9)
   goals met: 8 of 26
26. (take_image satellite2 phenomenon9 instrument5 infrared2)
   added: (have_image phenomenon9 infrared2)
   goals met: 9 of 26
27. (turn_to satellite2 planet13 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 planet13)
   goals met: 9 of 26
28. (take_image satellite2 planet13 instrument5 infrared2)
   added: (have_image planet13 infrared2)
   goals met: 10 of 26
29. (turn_to satellite2 planet14 planet13)
   deleted: (pointing satellite2 planet13)
   added: (pointing satellite2 planet14)
   goals met: 10 of 26
30. (take_image satellite2 planet14 instrument5 spectrograph1)
   added: (have_image planet14 spectrograph1)
   goals met: 11 of 26
31. (turn_to satellite2 planet20 planet14)
   deleted: (pointing satellite2 planet14)
   added: (pointing satellite2 planet20)
   goals met: 11 of 26
32. (take_image satellite2 planet20 instrument5 infrared2)
   added: (have_image planet20 infrared2)
   goals met: 12 of 26
33. (turn_to satellite2 planet21 planet20)
   deleted: (pointing satellite2 planet20)
   added: (pointing satellite2 planet21)
   goals met: 12 of 26
34. (take_image satellite2 planet21 instrument5 infrared2)
   added: (have_image planet21 infrared2)
   goals met: 13 of 26
35. (turn_to satellite2 planet4 planet21)
   deleted: (pointing satellite2 planet21)
   added: (pointing satellite2 planet4)
   goals met: 14 of 26
36. (take_image satellite2 planet4 instrument5 spectrograph1)
   added: (have_image planet4 spectrograph1)
   goals met: 15 of 26
37. (turn_to satellite0 groundstation0 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 groundstation0)
   goals met: 15 of 26
38. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 15 of 26
39. (turn_to satellite0 planet11 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet11)
   goals met: 15 of 26
40. (take_image satellite0 planet11 instrument0 thermograph3)
   added: (have_image planet11 thermograph3)
   goals met: 16 of 26
41. (turn_to satellite0 planet13 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet13)
   goals met: 17 of 26
42. (turn_to satellite2 planet7 planet4)
   deleted: (pointing satellite2 planet4)
   added: (pointing satellite2 planet7)
   goals met: 16 of 26
43. (take_image satellite2 planet7 instrument5 spectrograph1)
   added: (have_image planet7 spectrograph1)
   goals met: 17 of 26
44. (turn_to satellite2 planet4 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 planet4)
   goals met: 18 of 26
45. (turn_to satellite2 star10 planet4)
   deleted: (pointing satellite2 planet4)
   added: (pointing satellite2 star10)
   goals met: 17 of 26
46. (take_image satellite2 star10 instrument5 infrared2)
   added: (have_image star10 infrared2)
   goals met: 18 of 26
47. (turn_to satellite2 planet4 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 planet4)
   goals met: 19 of 26
48. (turn_to satellite2 star17 planet4)
   deleted: (pointing satellite2 planet4)
   added: (pointing satellite2 star17)
   goals met: 18 of 26
49. (take_image satellite2 star17 instrument5 spectrograph1)
   added: (have_image star17 spectrograph1)
   goals met: 19 of 26
50. (turn_to satellite2 planet4 star17)
   deleted: (pointing satellite2 star17)
   added: (pointing satellite2 planet4)
   goals met: 20 of 26
51. (turn_to satellite2 star18 planet4)
   deleted: (pointing satellite2 planet4)
   added: (pointing satellite2 star18)
   goals met: 19 of 26
52. (take_image satellite2 star18 instrument5 infrared2)
   added: (have_image star18 infrared2)
   goals met: 20 of 26
53. (turn_to satellite2 planet4 star18)
   deleted: (pointing satellite2 star18)
   added: (pointing satellite2 planet4)
   goals met: 21 of 26
54. (turn_to satellite2 star23 planet4)
   deleted: (pointing satellite2 planet4)
   added: (pointing satellite2 star23)
   goals met: 20 of 26
55. (take_image satellite2 star23 instrument5 infrared2)
   added: (have_image star23 infrared2)
   goals met: 21 of 26
56. (turn_to satellite2 planet4 star23)
   deleted: (pointing satellite2 star23)
   added: (pointing satellite2 planet4)
   goals met: 22 of 26
57. (turn_to satellite2 star27 planet4)
   deleted: (pointing satellite2 planet4)
   added: (pointing satellite2 star27)
   goals met: 21 of 26
58. (take_image satellite2 star27 instrument5 infrared2)
   added: (have_image star27 infrared2)
   goals met: 22 of 26
59. (turn_to satellite2 planet4 star27)
   deleted: (pointing satellite2 star27)
   added: (pointing satellite2 planet4)
   goals met: 23 of 26
60. (turn_to satellite2 star6 planet4)
   deleted: (pointing satellite2 planet4)
   added: (pointing satellite2 star6)
   goals met: 22 of 26
61. (take_image satellite2 star6 instrument5 infrared2)
   added: (have_image star6 infrared2)
   goals met: 23 of 26
62. (turn_to satellite2 planet4 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 planet4)
   goals met: 24 of 26
63. (turn_to satellite0 planet16 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet16)
   goals met: 23 of 26
64. (take_image satellite0 planet16 instrument0 thermograph3)
   added: (have_image planet16 thermograph3)
   goals met: 24 of 26
65. (turn_to satellite0 planet13 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 planet13)
   goals met: 25 of 26
66. (turn_to satellite0 planet24 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet24)
   goals met: 24 of 26
67. (take_image satellite0 planet24 instrument0 thermograph3)
   added: (have_image planet24 thermograph3)
   goals met: 25 of 26
68. (turn_to satellite0 planet13 planet24)
   deleted: (pointing satellite0 planet24)
   added: (pointing satellite0 planet13)
   goals met: 26 of 26
